Revit 2024 API
ReferencePointArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Insert(
	ReferencePoint item,
	int index
)
Visual Basic
Public Overridable Sub Insert ( _
	item As ReferencePoint, _
	index As Integer _
)
Visual C++
public:
virtual void Insert(
	ReferencePoint^ item,
	int index
)
Parameters
item
Type: Autodesk.Revit.DB.ReferencePoint
index
Type: System.Int32
See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace